{"type": "secondary", "year": "2021", "authors": "Abdul Manan, Muhammad Syafiq; Abang Jawawi, Dayang Norhayati; Ahmad, Johanna", "author_keys": ["abdul_manan_muhammad_syafiq", "abang_jawawi_dayang_norhayati", "ahmad_johanna"], "title": "A Systematic Literature Review on Test Case Prioritization in Combinatorial Testing", "abstract": "In recent years, regression testing is widely used and performed in industries during the maintenance phase of software system development. The increases of software regression test cases resulted in a higher complexity of the software system, due to the rapid change in the software development. Thus, many researchers had proposed the test cases prioritisation technique to overcome the raised issues. However, most of the applications needed the combinatorial testing due to the enormous size of the software inputs. The problem arises when the small t-way values were selected in combinatorial testing, which resulted in the ineffectiveness of the fault detection ability. This work presents the results of a systematic literature review on the test case prioritisation and combinatorial testing that report the main approach, problems, and evaluation metric that were being used from existing studies. This paper aims to identify the aspects of the test case prioritisation and combinatorial testing that have been studied before, provide a basis for the improvement, and evaluate the current trends of this research area. Apart from the recent works that were published in the last ten years, 20 papers were selected for further study in the systematic literature review. The results show that this area of study is open for improvement especially to efficiently generate the test cases, which minimise the number of test cases generated, and effectively prioritise the test cases that increase the fault detection ability in software testing. However, the use of both techniques still needs more enhancements for the existing proposed approach that could result in the increasing of the fault detection ability.", "published_in": "ICACS '21: 2021 The 5th International Conference on Algorithms, Computing and Systems", "publisher": "ACM", "bibtex": "abdul2021systematic", "doi": "10.1145/3490700.3490710", "date": "2022-01-05", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "20", "years_covered": "2011-2020", "systematic": "X", "context": "Combinatorial"}