{"type": "secondary", "year": "2018", "authors": "Bajaj, Anu; Sangwan, Om Prakash", "author_keys": ["bajaj_anu", "sangwan_om_prakash"], "title": "A survey on regression testing using nature-inspired approaches", "bibtex": "bajaj_survey_2018", "abstract": "Efficient regression testing plays an important role for organizations that have large investment in active, ever-changing software development. Efficiency can be obtained by optimizing the test cases as it provides a balance between the safety and precision. Many optimization techniques from various domains have been applied in regression testing for optimizing the search and the solutions. But nature-inspired algorithms are gaining more popularity now a days as the algorithms are more efficient for complex problems. In this paper, we have explored the research work done by various researchers on regression testing using nature-inspired approaches. It is found that biology inspired computation e.g. genetic algorithm have been widely used in regression testing optimization with the intent of maximizing fault or code coverage in minimum time. It is also concluded that nature-inspired approaches have great potential to optimize regression testing problems.", "published_in": "4th International Conference on Computing Communication and Automation (ICCCA)", "publisher": "IEEE", "doi": "10.1109/CCAA.2018.8777692", "date": "2019-07-29", "tcp": "X", "tcs": "X", "tsr": "X", "tsa": "", "paper_count": "15", "years_covered": "1999-2016", "systematic": "", "approach": "some Genetic and Evolutionary approaches, ant-colony opt, swarm opt., etc\nThey classify the techniques among: Physics/Chemistry Inspired,  Biology Inspired, and Social Phenomenon Inspired", "metrics": "They summarize that most used metrics are: \ntotal coverage, \nAPFD, \nexecution cost, and \nreduced percentage of test suite size\nIn the paper a table is included that give a detailed report of metrics in each study", "conclusions": "Genetic algorithms and biology-inspired are the most frequently used, and provide effective approaches", "open_challenges": "Lack of standard benchmarking data\nHow to choose the approach as there are many involved factors"}