{"year": "2019", "authors": "Bajaj, Anu; Sangwan, Om Prakash", "title": "A systematic literature review of test case prioritization using genetic algorithms", "bibtex": "bajaj_systematic_2019", "abstract": "Regression testing is the essential process of software maintenance and evolution phase of the software development life cycle for assuring the quality and reliability of updated software. Test case prioritization is the technique of regression testing to reduce the time and effort required for regression testing. Search-based algorithms are used to enhance the efficiency and effectiveness of the method. Among these search-based optimization algorithms, genetic algorithms are becoming more popular among researchers since the last decade. In this paper, we are doing a systematic literature review, i.e., a secondary study of test case prioritization using genetic algorithms. The objective of this review is to examine and classify the current state of use of the genetic algorithm in test case prioritization. In other words, to give a base for the advancement of test case prioritization research using genetic algorithms. With the use of the systematic literature review protocol, we selected the most relevant studies (20 out of 384) from the appropriate repositories by using a set of search keywords, inclusion/exclusion criteria and the quality assessment of studies. The data extraction and synthesis process and the taxonomic classification are used to answer the research questions. We also performed a rigorous analysis of the techniques by comparing them on research methodology, the prioritization method, dataset specification, test suite size, types of genetic algorithms used, performance metrics, and the validation criteria. The whole process took four months for comprehensive analysis and classification of primary studies. We observed that the parameter settings, the type of operators, the probabilistic rate of operators, and fitness function design have a significant impact on the quality of the solutions obtained. This systematic literature review yields that genetic algorithms have great potential in solving test case prioritization problems, and the area is open ...", "published_in": "IEEE Access", "publisher": "IEEE", "doi": "10.1109/ACCESS.2019.2938260", "date": "2019-08-29", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "20", "years_covered": "2006-2018", "systematic": "X", "approach": "They consider all different types of approaches all centered on GA. The classification they make is among: simple GA, enhanced, two or more and NSGA, single or multiobjective GA (which is reflected in the fitness funtion), the different type of operators, what they cover among code, reqs, fault.", "metrics": "APFD, Fault detection capability, average percentage of element coverage (?never heard?), coverage.", "conclusions": "More empirical research is needed, also in particular for setting the approach parameters\nThe large majority has used coverage that may be an issue, they would rcommend more req coverage.\nThey mention that works have used industrial application which are not available, and this may be a problem.\nImportant: they notice that scalability should be investigated", "open_challenges": "Lack of empirical studies; more requirements-based TCP; industrial & hardly-reproducible vs open & unrealistic datasets; small number of case studies for validation; scalability; lack of standard tools; genetic algorithms; performance metrics (APEC, FDC, CE); statistical analysis"}