{"type": "secondary", "year": "2021", "authors": "Hasnain, Muhammad; Ghani, Imran; Pasha, Muhammad Fermi; Jeong, Seung-Ryul", "author_keys": ["hasnain_muhammad", "ghani_imran", "pasha_muhammad_fermi", "jeong_seung-ryul"], "title": "Ontology-Based Regression Testing: A Systematic Literature Review", "abstract": "Web systems evolve by adding new functionalities or modifying them to meet users’ requirements. Web systems require retesting to ensure that existing functionalities are according to users’ expectations. Retesting a web system is challenging due to high cost and time consumption. Existing ‘systematic literature review’ (SLR) studies do not comprehensively present the ontology-based regression testing approaches. Therefore, this study focuses on ontology-based regression testing approaches because ontologies have been a growing research solution in regression testing. Following this, a systematic search of studies was performed using the “Preferred Reporting Items for Systematic Reviews and Meta-Analyses” (PRISMA) guidelines. A total of 24 peer-reviewed studies covering ontologies (semantic and inference rules) and regression testing, published between 2007 and 2019, were selected. The results showed that mainly ontology-based regression testing approaches were published in 2011–2012 and 2019 because ontology got momentum in research in other fields of study during these years. Furthermore, seven challenges to ontology-driven regression testing approaches are reported in the selected studies. Cost and validation are the main challenges examined in the research studies. The scalability of regression testing approaches has been identified as a common problem for ontology-based and other benchmark regression testing approaches. This SLR presents that the safety of critical systems is a possible future research direction to prevent human life risks.", "published_in": "Applied Sciences", "publisher": "MDPI", "bibtex": "hasnain2021ontology", "doi": "10.3390/app11209709", "date": "2021-10-18", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "24", "years_covered": "2007-2019", "systematic": "X", "context": "Ontology-based"}