{"type": "secondary", "year": "2020", "authors": "Hasnain, Muhammad; Ghani, Imran; Pasha, Muhammad Fermi; Lim, Chern Hong; Jeong, Seung Ryul", "author_keys": ["hasnain_muhammad", "ghani_imran", "pasha_muhammad_fermi", "lim_chern_hong", "jeong_seung_ryul"], "title": "A Comprehensive Review on Regression Test Case Prioritization Techniques for Web Services", "abstract": "Test Case Prioritization (TCP) involves the rearrangement of test cases on a prioritized basis for various services. This research work focuses on TCP in web services, as it has been a growing challenge for researchers. Web services continuously evolve and hence require reforming and re-execution of test cases to ensure the accurate working of web services. This study aims to investigate gaps, issues, and existing solutions related to test case prioritization. This study examines research publications within popular selected databases. We perform a meticulous screening of research publications and selected 65 papers through which to answer the proposed research questions. The results show that criteria-based test case prioritization techniques are reported mainly in 41 primary studies. Test case prioritization models, frameworks, and related algorithms are also reported in primary studies. In addition, there are eight issues related to TCP techniques. Among these eight issues, optimization and high effectiveness are most discussed within primary studies. This systematic review has identified that a significant proportion of primary studies are not involved in the use of statistical methods in measuring or comparing the effectiveness of TCP techniques. However, a large number of primary studies use 'Average Percentage of Faults Detected' (APFD) or extended APFD metrics to compute the performance of techniques for web services.\n", "published_in": "KSII Transactions on Internet and Information Systems (TIIS)", "publisher": "Korean Society for Internet Information", "bibtex": "hasnain_comprehensive_2020", "doi": "10.3837/tiis.2020.05.001", "date": "2020-05-31", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "65", "years_covered": "2001-2017", "systematic": "X", "context": "Web services"}