{"type": "secondary", "year": "2021", "authors": "Mohd-Shafie, Muhammad Luqman; Kadir, Wan Mohd Nasir Wan; Lichter, Horst; Khatibsyarbini, Muhammad; Isa, Mohd Adham", "author_keys": ["mohd-shafie_muhammad_luqman", "kadir_wan_mohd_nasir_wan", "lichter_horst", "khatibsyarbini_muhammad", "isa_mohd_adham"], "title": "Model-based test case generation and prioritization: a systematic literature review", "abstract": "Model-based test case generation (MB-TCG) and prioritization (MB-TCP) utilize models that represent the system under test (SUT) for test generation and prioritization in software testing. They are based on model-based testing (MBT), a technique that facilitates automation in testing. Automated testing is indispensable for testing complex and industrial-size systems because of its advantages over manual testing. In recent years, MB-TCG and MB-TCP publications have shown an encouraging growth. However, the empirical studies done to validate these approaches must not be taken lightly because they reflect the results' validity and whether these approaches are generalizable to the industrial context. This systematic review aims at identifying and reviewing the state-of-the-art for MB-TCG, MB-TCP, and the approaches that combined MB-TCG and MB-TCP. The needs for this review were used to design the research questions. Keywords extracted from the research questions were utilized to search for studies in the literature that will answer the research questions. Prospective studies also underwent a quality assessment to ensure that only studies with sufficient quality were selected. All the research data of this review are also available in a public repository for full transparency. 122 primary studies were finalized and selected. There were 100, 15, and seven studies proposed for MB-TCG, MB-TCP, and MB-TCG and MB-TCP combination approaches, respectively. One of the main findings is that the most common limitations in the existing approaches are the dependency on specifications, the need for manual interventions, and the scalability issue.", "published_in": "Software and Systems Modeling", "publisher": "Springer", "bibtex": "mohd2021model", "doi": "10.1007/s10270-021-00924-8", "date": "2021-09-07", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "22", "years_covered": "2005-2018", "systematic": "X", "context": "Model-based"}