{"type": "secondary", "year": "2018", "authors": "Rehman Khan, Saif Ur; Lee,  Sai Peck; Javaid, Nadeem; Abdul, Wadood", "author_keys": ["rehman_khan_saif_ur", "lee__sai_peck", "javaid_nadeem", "abdul_wadood"], "title": "A systematic review on test suite reduction: Approaches, experiment’s quality evaluation, and guidelines", "abstract": "Regression testing aims at testing a system under test (SUT) in the presence of changes. As a SUT changes, the number of test cases increases to handle the modifications, and ultimately, it becomes practically impossible to execute all of them within limited testing budget. Test suite reduction (TSR) approaches are widely used to improve the regression testing costs by selecting representative test suite without compromising effectiveness, such as fault-detection capability, within allowed time budget. The aim of this systematic review is to identify state-of-the-art TSR approaches categories, assess the quality of experiments reported on this subject, and provide a set of guidelines for conducting future experiments in this area of research. After applying a two-facet study selection procedure, we finalized 113 most relevant studies from an initial pool of 4230 papers published in the field of TSR between 1993 and 2016. The TSR approaches are broadly classified into four main categories based on the literature including greedy, clustering, search, and hybrid approaches. It is noted that majority of the experiments in TSR do not follow any specific guidelines for planning, conducting, and reporting the experiments, which may pose validity threats related to their results. Thus, we recommend conducting experiments that are better designed for the future. In this direction, an initial set of recommendations is provided that are useful for performing well-designed experiments in the field of TSR. Furthermore, we provide a number of future research directions based on current trends in this field of research.", "published_in": "IEEE Access", "publisher": "IEEE", "bibtex": "rehman_khan_systematic_2018", "doi": "10.1109/ACCESS.2018.2809600", "date": "2018-02-27", "tcp": "", "tcs": "", "tsr": "X", "tsa": "", "paper_count": "113", "years_covered": "1993-2016", "systematic": "X", "context": ""}