{"type": "secondary", "year": "2021", "authors": "Samad, Ali; Mahdin, Hairulnizam; Kazmi, Rafaqut; Ibrahim, Rosziati", "author_keys": ["samad_ali", "mahdin_hairulnizam", "kazmi_rafaqut", "ibrahim_rosziati"], "title": "Regression Test Case Prioritization: A Systematic Literature Review", "abstract": "Abstract: The techniques associated with the Test Case Prioritization (TCP) are used to reduce the cost of regression testing to achieve the objectives that the modifications in the target code would not impact the functionality of updated software. The effectiveness of the TCP is measured based on the cost, the code coverage, and fault detection ability. The regression testing techniques proposed so far are focusing on one or two effectiveness parameters. In this paper, we presented a state-of-art review of the approaches used in regression testing in detail. The second objective is to combine these effective adequacy measures into a single or multi-objective TCP task. This systematic literature review is conducted to identify the state-of-the-art research in regression TCP from 2007 to 2020. The research identifies fifty-two (52) relevant studies that were focusing on these three selection parameters to justify their findings. The results reveal that there were six families of regression TCP in which meta-heuristic regression TCP were reported in 38% and generic regression TCP techniques in 31%. The parameters used as prioritization criteria were cost, code coverage, and fault detection ability. The code coverage is reported by 38%, cost in 17%, and cost and code coverage in 31%. There were three sources for datasets were identified named Software artefact Infrastructure Repository (SIR), Apache Software Foundation, and Git Hub. The measurement and metrics used to validate the effectiveness are inclusiveness, precision, recall, and retest-all.", "published_in": "International Journal of Advanced Computer Science and Applications", "publisher": "SAI", "bibtex": "samad2021regression", "doi": "10.14569/IJACSA.2021.0120282 ", "date": "2021", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "paper_count": "52", "years_covered": "2007-2019", "systematic": "X", "context": ""}