{"year":2016,"authors":"Tahvili, Sahar; Saadatmand, Mehrdad; Larsson, Stig; Afzal, Wasif; Bohlin, Markus; Sundmark, Daniel","title":"Dynamic integration test selection based on test case dependencies","bibtex":"tahvili_dynamic_2016","abstract":"Prioritization, selection and minimization of test cases are well-known problems in software testing. Test case prioritization deals with the problem of ordering an existing set of test cases, typically with respect to the estimated likelihood of detecting faults. Test case selection addresses the problem of selecting a subset of an existing set of test cases, typically by discarding test cases that do not add any value in improving the quality of the software under test. Most existing approaches for test case prioritization and selection suffer from one or several drawbacks. For example, they to a large extent utilize static analysis of code for that purpose, making them unfit for higher levels of testing such as integration testing. Moreover, they do not exploit the possibility of dynamically changing the prioritization or selection of test cases based on the execution results of prior test cases. Such dynamic analysis allows for discarding test cases that do not need to be executed and are thus redundant. This paper proposes a generic method for prioritization and selection of test cases in integration testing that addresses the above issues. We also present the results of an industrial case study where initial evidence suggests the potential usefulness of our approach in testing a safety-critical train control management subsystem.","published_in":"2016 IEEE Ninth International Conference on Software Testing, Verification and Validation Workshops (ICSTW)","publisher":"IEEE","source":"backward","doi":"https://doi.org/10.1109/ICSTW.2016.14","date":"2016-08-04","categories":"","tcp":"X","tcs":"X","tsr":"","tsa":"","context":"Combined static and dynamic selection and prioritization of integration tests","ind_motivation":"TRUE","ind_evaluation":"TRUE","exp_subjects":"Brake and air supply systems from Bombardier","ind_partner":"Bombardier Transportation (Sweden)","ind_author":"FALSE","prac_feedback":"TRUE","avai_tool":"N/A","put_practice":"MAYBE","suppl_url":"","included":"TRUE","approach":"The work combines offline prioritization with online selection from the prioritized sets. \nThis work is related to row 5 and here test case dependencies are also captured manually.","metrics":"Requirement coverage; time efficiency; cost efficiency; fault detection probability. Introduces a \"dependency degree\" metric for prioritizing test cases; these are not an evaluation metric, but rather metrics attributed to each test case used by the TCP algorithm.","open_challenges":"n/a"}
