{"year":2016,"authors":"Tahvili, Sahar; Bohlin, Markus; Saadatmand, Mehrdad; Larsson, Stig; Afzal, Wasif; Sundmark, Daniel","title":"Cost-benefit analysis of using dependency knowledge at integration testing","bibtex":"tahvili_cost-benefit_2016","abstract":"In software system development, testing can take considerable time and resources, and there are numerous examples in the literature of how to improve the testing process. In particular, methods for selection and prioritization of test cases can play a critical role in efficient use of testing resources. This paper focuses on the problem of selection and ordering of integration-level test cases. Integration testing is performed to evaluate the correctness of several units in composition. Further, for reasons of both effectiveness and safety, many embedded systems are still tested manually. To this end, we propose a process, supported by an online decision support system, for ordering and selection of test cases based on the test result of previously executed test cases. To analyze the economic efficiency of such a system, a customized return on investment (ROI) metric tailored for system integration testing is introduced. Using data collected from the development process of a large-scale safety-critical embedded system, we perform Monte Carlo simulations to evaluate the expected ROI of three variants of the proposed new process. The results show that our proposed decision support system is beneficial in terms of ROI at system integration testing and thus qualifies as an important element in improving the integration testing process. © Springer International Publishing AG 2016.","published_in":"PROFES 2016: Product-Focused Software Process Improvement","publisher":"Springer","source":"Query","doi":"https://doi.org/10.1007/978-3-319-49094-6_17","date":"2016-11-06","categories":"Orchestration technique","tcp":"X","tcs":"","tsr":"","tsa":"","context":"Embedded systems\nNL test cases","ind_motivation":"TRUE","ind_evaluation":"TRUE","exp_subjects":"Train control managment subsystem (4578 TCs)","ind_partner":"Bombardier Transportation (Sweden)","ind_author":"FALSE","prac_feedback":"FALSE","avai_tool":"N/A","put_practice":"FALSE","suppl_url":"","included":"TRUE","approach":"the paper evaluates the ROI for the TCP approach proposed in row 42; here they build a cost model and compare the costs of using TCP or not. Note that the TCP uses dependencies among tests that are identifies manually","metrics":"Return on investment","open_challenges":"- do study on real data and not on simulation\n-consider other criteria for TCP"}
