{"year":2020,"authors":"Zhou, Zhi Quan; Liu, Chen; Chen, Tsong Yueh; Tse, T. H.; Susilo, Willy","title":"Beating Random Test Case Prioritization","bibtex":"zhou_beating_2020","abstract":"Existing test case prioritization (TCP) techniques have limitations when\n applied to real-world projects, because these techniques require \ncertain information to be made available before they can be applied. For\n example, the family of input-based TCP techniques are based on test \ncase values or test script strings; other techniques use test coverage, \ntest history, program structure, or requirements information. Existing \ntechniques also cannot guarantee to always be more effective than random\n prioritization (RP) that does not have any precondition. As a result, \nRP remains the most applicable and most fundamental TCP technique. This \narticle proposes an extremely simple, effective, and efficient way to \nprioritize test cases through the introduction of a dispersity metric. \nOur technique is as applicable as RP. We conduct empirical studies using\n 43 different versions of 15 real-world projects. Empirical results show\n that our technique is more effective than RP. Our algorithm has a \nlinear computational complexity and, therefore, provides a practical \nsolution to the problem of prioritizing very large test suites (such as \nthose containing hundreds of thousands, or millions, of test cases), \nwhere the execution time of conventional nonlinear prioritization \nalgorithms can be prohibitive. Our technique also provides a practical \nsolution to TCP when neither input-based nor execution-based techniques \nare applicable due to lack of information.","published_in":"IEEE Transactions on Reliability","publisher":"IEEE","source":"forward","doi":"https://doi.org/10.1109/TR.2020.2979815","date":"2020-06-16","categories":"","tcp":"X","tcs":"","tsr":"","tsa":"","context":"","ind_motivation":"TRUE","ind_evaluation":"TRUE","exp_subjects":"Major open-source multi language projects, including Firefox (480575 TCs) and SQLite (787530 TCs)","ind_partner":"","ind_author":"FALSE","prac_feedback":"FALSE","avai_tool":"FALSE","put_practice":"FALSE","suppl_url":"","included":"TRUE","approach":"Similarity-based","metrics":"Applicability, APFD, F-measure, time till first failure","open_challenges":""}
