{"type": "primary", "year": "2022", "authors": "Abdelkarim, Mohamed; ElAdawi, Reem", "author_keys": ["abdelkarim_mohamed", "eladawi_reem"], "title": "TCP-Net: Test Case Prioritization using End-to-End Deep Neural Networks", "bibtex": "abdelkarim_tcp-net_2022", "abstract": "Regression testing is facing a bottleneck due to the growing number of test cases and the wide adoption of continuous integration (CI) in software projects, which increases the frequency of running software builds, making it challenging to run all the regression test cases. Machine learning (ML) techniques can be used to save time and hardware resources without compromising quality. In this work, we introduce a novel end-to-end, self-configurable, and incremental learning deep neural network (DNN) tool for test case prioritization (TCP-Net). TCP-Net is fed with source code-related features, test case metadata, test case coverage information, and test case failure history, to learn a high dimensional correlation between source files and test cases. We experimentally show that TCP-Net can be efficiently used for test case prioritization by evaluating it on three different real-life industrial software packages.", "published_in": "2022 IEEE International Conference on Software Testing, Verification and Validation Workshops (ICSTW)", "publisher": "IEEE", "doi": "10.1109/ICSTW55395.2022.00034", "date": "2022-06-08", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE\n(\"Experimentation with the TCP-Net on three industrial\ndatasets, showing the potential of our approach for integration\ninto CI regression testing in practical environments.)", "exp_subjects": "Industrial proprietary, large to very large scale\n\n - Calibre Auto-Waivers (2k TCs)\n - Calibre PERC (11k TCs)\n - Calibre nmDRC (3k TCs)", "prog_language": "Unclear", "ind_partner": "Siemens EDA (Egypt)", "ind_author": "TRUE\n(the two authors are from Siemens EDA)", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Deep Neural Networks for TCP", "metrics": " - APFD\n - Accuracy, precision, recall, and F1-score", "open_challenges": "\"For future work, more incremental learning\napproaches will be explored and tested.\""}