{"type": "primary", "year": "2016", "authors": "Aman, Hirohisa; Tanaka, Yuta; Nakano, Takashi; Ogasawara, Hideto; Kawahara, Minoru", "author_keys": ["aman_hirohisa", "tanaka_yuta", "nakano_takashi", "ogasawara_hideto", "kawahara_minoru"], "title": "Application of Mahalanobis-Taguchi Method and 0-1 Programming Method to Cost-Effective Regression Testing", "bibtex": "aman_application_2016", "abstract": "To enhance the cost effectiveness of regression testing, this paper proposes a method for prioritizing test cases. In general, a test case can be evaluated from various different points of view, therefore whether it is worth it to re-run should be discussed using multi criteria. This paper shows that the Mahalanobis-Taguchi (MT) method is a useful way to successfully integrate different evaluations of a test case. Moreover, this paper proposes to use the 0-1 programming method together with the MT method in order to take into account not only the priority of a test case but also its cost to run. The empirical study with 300 test cases for an industrial software system shows that the combination of the MT method and the 0-1 programming method is more cost-effective than other conventional methods. © 2016 IEEE.", "published_in": "2016 42th Euromicro Conference on Software Engineering and Advanced Applications (SEAA)", "publisher": "IEEE", "doi": "10.1109/SEAA.2016.29", "date": "2016-10-18", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "FALSE", "ind_evaluation": "TRUE", "exp_subjects": "Undisclosed system from Toshiba (300 TCs)\n\nIndustrial proprietary, small scale", "prog_language": "Unclear", "ind_partner": "Toshiba (Japan)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "MAYBE", "suppl_url": "", "approach": "Similarity-based", "info_approach": "History-based", "alg_approach": "Similarity / distance-based", "metrics": "GLC (number of versions in which a certain test T was not run), failure rate", "effe_metrics": "Fault Detection Rate (FDR)", "effi_metrics": "", "other_metrics": "", "open_challenges": "Apply in other software domains and compare with other TCP techniques."}