{"type": "primary", "year": "2018", "authors": "Azizi, Maral; Do, Hyunsook", "author_keys": ["azizi_maral", "do_hyunsook"], "title": "Retest: A cost effective test case selection technique for modern software development", "bibtex": "azizi_retest_2018", "abstract": "Regression test selection offers cost savings by selecting a subset of existing tests when testers validate the modified version of the application. The majority of test selection approaches utilize static or dynamic analyses to decide which test cases should be selected, and these analyses are often very time consuming. In this paper, we propose a novel language-independent Regression TEst SelecTion (ReTEST) technique that facilitates a lightweight analysis by using information retrieval. ReTEST uses fault history, test case diversity, and program change history information to select test cases that should be rerun. Our empirical evaluation with four open source programs shows that our approach can be effective and efficient by selecting a far smaller subset of tests compared to the existing techniques.", "published_in": "2018 IEEE 29th International Symposium on Software Reliability Engineering (ISSRE)", "publisher": "IEEE", "doi": "10.1109/ISSRE.2018.00025", "date": "2018-11-19", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Two open-source .net and C# programs (up to 628 TCs) and two Java subjects from Defects4J (up to 393 TCs)\n\nOpen-source, medium scale\nResearch dataset, small scale", "prog_language": "C#, Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Graph-based", "info_approach": "", "alg_approach": "Graph-based", "metrics": "selection count, fault detection rate", "effe_metrics": "Selection/reduction count/percentage, Fault Detection Rate (FDR)", "effi_metrics": "", "other_metrics": "", "open_challenges": "automate parameter selection, apply approach on TCP and TSR."}