{"year": "2017", "authors": "Bach, Thomas; Andrzejak, Artur; Pannemans, Ralf", "title": "Coverage-Based Reduction of Test Execution Time: Lessons from a Very Large Industrial Project", "bibtex": "bach_coverage-based_2017", "abstract": "There exist several coverage-based approaches to reduce time and resource costs of test execution. While these methods are well-investigated and evaluated for smaller to medium-size projects, we faced several challenges in applying them in the context of a very large industrial software project, namely SAP HANA. These issues include: varying effectiveness of algorithms for test case selection/prioritization, large amounts of shared (non-specific) coverage between different tests, high redundancy of coverage data, and randomness of test results (i.e. flaky tests), as well as of the coverage data (e.g. due to concurrency issues). We address these issues by several approaches. First, our study shows that compared to standard algorithms, so-called overlap-aware solvers can achieve up to 50% higher code coverage in a fixed time budget, significantly increasing the effectiveness of test case prioritization and selection. We also detected in our project high redundancy of line coverage data (up to 97%), providing opportunities for data size reduction. Finally, we show that removal of coverage shared by tests can significantly increase test specificity. Our analysis and approaches can help to narrow the gap between research and practice in context of coverage-based testing approaches, especially in case of very large software projects. © 2017 IEEE.", "published_in": "2017 IEEE International Conference on Software Testing, Verification and Validation Workshops (ICSTW)", "publisher": "IEEE", "doi": "10.1109/ICSTW.2017.6", "date": "2017-04-17", "tcp": "X", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE ", "exp_subjects": "Database management system (19472 TCs)", "ind_partner": "SAP SE (Germany)", "ind_author": "TRUE", "prac_feedback": "TRUE ", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "", "approach": "Greedy (algo)\n\nCoverage-based and overlap-aware (info)", "metrics": "Coverage", "open_challenges": "Flaky tests, experiment with other over-lap aware heuristics."}