{"type": "primary", "year": "2021", "authors": "Bagherzadeh, Mojtaba; Kahani, Nafiseh; Briand, Lionel", "author_keys": ["bagherzadeh_mojtaba", "kahani_nafiseh", "briand_lionel"], "title": "Reinforcement learning for test case prioritization", "bibtex": "bagherzadeh_reinforcement_2022", "abstract": "Continuous Integration (CI) significantly reduces integration problems, speeds up development time, and shortens release time. However, it also introduces new challenges for quality assurance activities, including regression testing, which is the focus of this work. Though various approaches for test case prioritization have shown to be very promising in the context of regression testing, specific techniques must be designed to deal with the dynamic nature and timing constraints of CI. Recently, Reinforcement Learning (RL) has shown great potential in various challenging scenarios that require continuous adaptation, such as game playing, real-time ads bidding, and recommender systems. Inspired by this line of work and building on initial efforts in supporting test case prioritization with RL techniques, we perform here a comprehensive investigation of RL-based test case prioritization in a CI context. To this end, taking test case prioritization as a ranking problem, we model the sequential interactions between the CI environment and a test case prioritization agent as an RL problem, using three alternative ranking models. We then rely on carefully selected and tailored state-of-the-art RL techniques to automatically and continuously learn a test case prioritization strategy, whose objective is to be as close as possible to the optimal one. Our extensive experimental analysis shows that the best RL solutions provide a significant accuracy improvement over previous RL-based work, with prioritization strategies getting close to being optimal, thus paving the way for using RL to prioritize test cases in a CI context.", "published_in": "IEEE Transactions on Software Engineering ( Volume: 48, Issue: 8, 01 August 2022) ", "publisher": "IEEE", "doi": "10.1109/TSE.2021.3070549", "date": "2021-04-02", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE\n(given the CI context)", "ind_evaluation": "FALSE", "exp_subjects": "8 Java projects (6 Apache Commons projects)", "prog_language": "Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "FALSE", "approach": "Evaluation of multiple SOA reinforcement learning approaches for test prioritization in CI. ", "metrics": " - Normalized Rank Percentile Average (NRPA)\n - Average Percentage of Faults Detected (APFD)", "open_challenges": " - Automatically and systematically using search-based\nfor tuning and optimization the approach\n\n- Preparing of a rich dataset and a benchmark."}