{"year": "2017", "authors": "Chi, Zongzheng; Xuan, Jifeng; Ren, Zhilei; Xie, Xiaoyuan; Guo, He", "title": "Multi-Level Random Walk for Software Test Suite Reduction", "bibtex": "chi_multi-level_2017", "abstract": "Which test cases should be selected to save the time of software testing? Due to the large time cost of running all test cases, it is necessary to run representative test cases to shorten the software development cycle. Test suite reduction, an NP-hard problem in software engineering, aims to select a subset of test cases to reduce the time cost of test execution in satisfying test requirements. Recently, search based software engineering provides a new direction to test suite reduction by connecting software engineering problems with computational intelligence methods. In this paper, we propose a multi-level optimization algorithm to simplify the original problem instance of test suite reduction. In each level, we search for local optimal solutions with random walk in potential subsets of the test suite. The problem scale is reduced by locking the intersection of local optima and by discarding shielded test cases with no contribution to test requirements. We compare our algorithm with state-of-the-art methods on test suites of ten large-scale open source projects. Experiments show that our algorithm can more efficiently find optima on five out of six projects, in which Integer Linear Programming (ILP) can find optima; for the other four projects that ILP fails to solve, our algorithm provides the best solutions among heuristics in comparison. © 2017 IEEE.", "published_in": "IEEE Computational Intelligence Magazine", "publisher": "IEEE", "doi": "10.1109/MCI.2017.2670460", "date": "2017-04-12", "tcp": "", "tcs": "", "tsr": "X", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Open-source Java projects (up to 6196 TCs)", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "http://cstar.whu.edu.cn/p/multi-walk/", "approach": "search-based", "metrics": "reduction rate, runtime", "open_challenges": ""}