{"type": "primary", "year": "2022", "authors": "Çıngıl, Tutku; Sözer, Hasan", "author_keys": ["cingil_tutku", "sozer_hasan"], "title": "Black-box Test Case Selection by Relating Code Changes with Previously Fixed Defects", "bibtex": "cingil_black-box_2022", "abstract": "Software continuously changes to address new requirements and to fix defects. Regression testing is performed to ensure that the applied changes do not adversely affect existing functionality. The increasing number of test cases makes it infeasible to execute the whole regression test suite. Test case selection is adopted to select a subset of the test suite, which is associated with the changed parts of the software. These parts are assumed to be error-prone. We present and evaluate a test case selection approach in the context of black-box regression testing of embedded systems. In this context, it is challenging to relate test cases with a set of distinct source code elements to be able to select those test cases associated with the modified parts of the source code. We analyze previously fixed defects for this purpose. We relate test cases that detect these defects with the source files that are previously modified for fixing them. Then, we select test cases related with source code files that are modified in the subsequent revision. The strength of this relation is determined as the number of changes associated with fixed defects previously detected by the same test cases. We conduct a case study on 3 real projects from the consumer electronics domain. Results show that it is possible to detect from 65% up to 85% of the defects detected by the whole test suite by selecting from 30% up to 70% of the test cases.", "published_in": "EASE '22: Proceedings of the International Conference on Evaluation and Assessment in Software Engineering 2022", "publisher": "ACM", "doi": "10.1145/3530019.3530023", "date": "2022-06-13", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Industrial proprietary: small number of tests (38) but long duration (7+ hours)", "prog_language": "Unclear", "ind_partner": "Vestel (Turkey)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "change-based and fault-based; relating new code changes to previously fixed defects.", "metrics": "\"percentage of bugs detected\", a sort of fault detection capability; selection percentage, ratio of field errors, selected test case duration", "open_challenges": ""}