{"type": "primary", "year": "2020", "authors": "Dirim, Sahin; Sozer, Hasan", "author_keys": ["dirim_sahin", "sozer_hasan"], "title": "Prioritization of Test Cases with Varying Test Costs and Fault Severities for Certification Testing", "bibtex": "dirim_prioritization_2020", "abstract": "We present an industrial case study on the application of test case prioritization techniques in the context of certification testing in consumer electronics domain. Test execution times and fault severities are subject to high variations in this domain. As a result, most of the existing techniques and metrics turn out to be inappropriate for this application context. We discuss such deficiencies and the room for improvement based on our case study with the certification test suites of 3 Smart TV applications as real experimental objects. We also propose a new metric, LAPFD, which is based on the calculation of the average of the percentage of faults detected. This calculation is weighted according to the cost of test cases and calculated separately per severity class. Then, a lexicographic ordering is performed based on these classes. We compared the baseline (random) ordering of test cases with respect to an alternative ordering based on cost, measured as the test execution time. These alternative orderings are evaluated by using the LAPFD metric. We observed that cost-based ordering of test cases consistently outperformed random ordering. Another observation is that there is a large room for improvement regarding the effectiveness of test case prioritization in this application domain.", "published_in": "2020 IEEE International Conference on Software Testing, Verification and Validation Workshops (ICSTW)", "publisher": "IEEE", "doi": "10.1109/ICSTW50294.2020.00069", "date": "2020-08-04", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Smart TV applications for Netflix, YouTube and Prime Video (up to 213 TCs — but up to 40 hours)", "ind_partner": "Vestel Electronics (Turkey)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "MAYBE", "suppl_url": "", "approach": "very simple, prioritize test cases based on their execution time (shortest first)", "metrics": "LAPFD (variant of APFD the considers cost for each of 4 severity classes)", "open_challenges": "consider other TCP techniques as lexographic or history based"}