{"year": "2019", "authors": "Eda, Ravi; Do, Hyunsook ", "title": "An efficient regression testing approach for PHP Web applications using test selection and reusable constraints", "bibtex": "eda_efficient_2019", "abstract": "Web applications undergo frequent changes. These changes can be due to the addition of new features or the modification of existing features to support customer requests or to patch faults in the system. Given that Web applications have a large surface area subject to attack, changes often include security fixes either in response to malicious attacks or to forestall such attacks. Effective regression testing should ensure that any change does not disable existing features or compromise security. Executing the entire regression test suite takes time and consumes many resources. One approach is to focus regression test efforts only on code paths that were modified in the new version. Such code paths can be identified using tools such as PHP Analysis and Regression Testing Engine (PARTE). In this paper, we extend this approach to test selection where a subset of existing tests that cover the modified code paths can be detected. To further reduce the amount of regression testing needed, we used PARTE’s reusable constraint value information to identify tests that can be reused against the new version without having to modify the input test values. We performed an empirical study to determine whether test selection data combined with reusable constraint values would further improve the turnaround time for regression tests. Results from the experiment conducted on four Hypertext Preprocessor (PHP) web applications demonstrate that this approach is effective in reducing the cost of regression testing of frequently patched Web applications.", "published_in": "Software Quality Journal", "publisher": "Springer", "doi": "10.1007/s11219-019-09449-2", "date": "2019-06-11", "tcp": "", "tcs": "X", "tsr": "X", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source PHP projects (up to 124 TCs)", "ind_partner": "", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Change-based", "metrics": "Selected tests, obsolete tests, reusable inputs", "open_challenges": ""}