{"type": "primary", "year": "2018", "authors": "Garousi, Vahid; Özkan, Ramazan; Betin-Can, Aysu", "author_keys": ["garousi_vahid", "ozkan_ramazan", "betin-can_aysu"], "title": "Multi-objective regression test selection in practice: An empirical study in the defense software industry", "bibtex": "garousi_multi-objective_2018", "abstract": "Context: Executing an entire regression test-suite after every code change is often costly in large software projects. To cope with this challenge, researchers have proposed various regression test-selection techniques. Objective: This paper was motivated by a real industrial need to improve regression-testing practices in the context of a safety-critical industrial software in the defence domain in Turkey. To address our objective, we set up and conducted an “action-research” collaborative project between industry and academia. Method: After a careful literature review, we selected a conceptual multi-objective regression-test selection framework (called MORTO) and adopted it to our industrial context by developing a custom-built genetic algorithm (GA) based on that conceptual framework. GA is able to provide full coverage of the affected (changed) requirements while considering multiple cost and benefit factors of regression testing. e.g., minimizing the number of test cases, and maximizing cumulative number of detected faults by each test suite. Results: The empirical results of applying the approach on the Software Under Test (SUT) demonstrate that this approach yields a more efficient test suite (in terms of costs and benefits) compared to the old (manual) test-selection approach, used in the company, and another applicable approach chosen from the literature. With this new approach, regression selection process in the project under study is not ad-hoc anymore. Furthermore, we have been able to eliminate the subjectivity of regression testing and its dependency on expert opinions. Conclusion: Since the proposed approach has been beneficial in saving the costs of regression testing, it is currently in active use in the company. We believe that other practitioners can apply our approach in their regression-testing contexts too, when applicable. Furthermore, this paper contributes to the body of evidence in regression testing by offering a success story of successful implementation and application of multi-objective regression testing in practice. © 2018", "published_in": "Information and Software Technology", "publisher": "Elsevier", "doi": "10.1016/j.infsof.2018.06.007", "date": "2018-06-30", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Defense software system (up to 3588 TCs)", "ind_partner": "Government organization (Turkey)", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "TRUE", "put_practice": "TRUE", "suppl_url": "https://zenodo.org/record/1149058#.Xto4gfKxVTY", "approach": "multi-objective genetic algorithm", "metrics": "Test execution time, third-party costs, system setup costs, technical resources cost, verification cost", "open_challenges": ""}