{"type": "primary", "year": "2017", "authors": "Gotlieb, Arnaud; Marijan, Dusica", "author_keys": ["gotlieb_arnaud", "marijan_dusica"], "title": "Using global constraints to automate regression testing", "bibtex": "gotlieb_using_2017", "abstract": "Communicating or autonomous systems rely on high-quality software-based components. that must be thoroughly verified before they are released and deployed in operational settings. Regression testing is a crucial verification process that compares any new release of a software-based component against its previous versions, by executing available test cases. However, limited testing time makes selection of test cases in regression testing challenging, and some selection criteria must be respected. Validation engineers usually address this problem, coined as test suite reduction (TSR), through manual analysis or by using approximation techniques. In this paper, we address the TSR problem with sound artificial intelligence techniques such as constraint programming (CP) and global constraints. By using distinct cost-value-aggregating criteria, we propose several constraint-optimization models to find a subset of test cases that cover all the test requirements and optimize the overall cost of selected test cases. Our contribution includes reuse of existing preprocessing rules to simplify the problem before solving it and the design of structure-aware heuristics that take into account the notion of the costs associated with test cases. The work presented in this paper has been motivated by an industrial application in the communication domain. Our overall goal is to develop a constraint-based approach of test suite reduction that can be deployed to test a complete product line of conferencing systems in continuous delivery mode. By implementing this approach in a software prototype tool and experimentally evaluating it on both randomly generated and industrial instances, we hope to foster a quick adoption of the technology. Copyright © 2017, Association for the Advancement of Artificial Intelligence. All rights reserved.", "published_in": "\n\nAI Magazine", "publisher": "AAAI", "doi": "10.1609/aimag.v38i1.2714", "date": "2017-03-31", "tcp": "", "tcs": "", "tsr": "X", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Cisco videoconferencing system (377 TCs)", "ind_partner": "Cisco (Norway)", "ind_author": "FALSE", "prac_feedback": "TRUE", "avai_tool": "FALSE", "put_practice": "MAYBE", "suppl_url": "", "approach": "Optimized approach to Constraint-based test suite reduction and its evalutation in comparison with SOTA", "metrics": "CPU time of solving\nTest suite size reduction", "open_challenges": "- improve preprocessing  heuristics for improving efficiency\n- increase usability to facilitate industrial adoption"}