{"year": "2019", "authors": "Guo, Bo; Kwon, Young-Woo; Song, Myoungkyu", "title": "Decomposing Composite Changes for Code Review and Regression Test Selection in Evolving Software", "bibtex": "guo_decomposing_2019", "abstract": "Inspecting and testing code changes typically require a significant amount of developer effort. As a system evolves, developers often create composite changes by mixing multiple development issues, as opposed to addressing one independent issue — an atomic change. Inspecting composite changes often becomes time-consuming and error-prone. To test unrelated edits on composite changes, rerunning all regression tests may require excessive time. To address the problem, we present an interactive technique for change decomposition to support code reviews and regression test selection, called ChgCutter. When a developer specifies code change within a diff patch, ChgCutter partitions composite changes into a set of related atomic changes, which is more cohesive and self-contained regarding the issue being addressed. For composite change inspection, it generates an intermediate program version that only includes a related change subset using program dependence relationships. For cost reduction during regression testing, it safely selects only affected tests responsible for changes to an intermediate version. In the evaluation, we apply ChgCutter to 28 composite changes in four open source projects. ChgCutter partitions these changes with 95.7% accuracy, while selecting affected tests with 89.0% accuracy. We conduct a user study with professional software engineers at PayPal and find that ChgCutter is helpful in understanding and validating composite changes, scaling to industry projects. © 2019, Springer Science+Business Media, LLC & Science Press, China.", "published_in": "Journal of Computer Science and Technology ", "publisher": "Springer", "doi": "10.1007/s11390-019-1917-9", "date": "2019-03-22", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Generated test suite based on four open-source Java projects (totaling 3456 TCs)", "ind_partner": "PayPal (USA)", "ind_author": "TRUE", "prac_feedback": "TRUE", "avai_tool": "TRUE", "put_practice": "TRUE", "suppl_url": "https://sites.google.com/unomaha.edu/interactively-partitioning", "approach": "Change-based", "metrics": "Precision/Recall", "open_challenges": ""}