{"year": "2016", "authors": "Hirzel, Matthias; Klaeren, Herbert", "title": "Graph-walk-based selective regression testing of web applications created with Google web toolkit", "bibtex": "hirzel_graph-walk-based_2016", "abstract": "Modern web applications are usually based on JavaScript. Due to its loosely typed, dynamic nature, test execution is time expensive and costly. Techniques for regression testing and fault-localization as well as frameworks like the Google Web Toolkit (GWT) ease the develop- ment and testing process, but still require approaches to reduce the testing effort. In this paper, we investigate the efficiency of a spe- cialized, graph-walk based selective regression testing technique that aims to detect code changes on the client side in order to determine a reduced set of web tests. To do this, we analyze web applications created with GWT on different precision levels and with varying looka- heads. We examine how these parameters affect the localization of client-side code changes, run time, memory consumption and the num- ber of web tests selected for re-execution. In addition, we propose a dynamic heuristics which targets an analysis that is as exact as possible while reducing memory consumption. The results are partially appli- cable on non-GWT applications. In the context of web applications,we see that the efficiency relies to a great degree on both the structure of the application and the code modifications, which is why we propose further measures tailored to the results of our approach.", "published_in": "Software Engineering Workshops 2016", "publisher": "CEUR", "doi": "http://ceur-ws.org/Vol-1559/paper05.pdf", "date": "2016-02-17", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "FALSE", "ind_evaluation": "TRUE", "exp_subjects": "Hupa (32 TCs) and Meisterplan (104 TCs)", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "TRUE", "put_practice": "FALSE", "suppl_url": "https://github.com/MH42/srt-for-web-apps", "approach": "Graph-based", "metrics": "Time/memory consumption, selection percentage", "open_challenges": ""}