{"type": "primary", "year": "2020", "authors": "Magalhães, Claudio; Andrade, João; Perrusi, Lucas; Mota, Alexandre; Barros, Flávia; Maia, Eliot", "author_keys": ["magalhaes_claudio", "andrade_joao", "perrusi_lucas", "mota_alexandre", "barros_flavia", "maia_eliot"], "title": "HSP: A hybrid selection and prioritisation of regression test cases based on information retrieval and code coverage applied on an industrial case study", "bibtex": "magalhaes_hsp_2020", "abstract": "The usual way to guarantee quality of software products is via testing. This paper presents a novel strategy for selection and prioritisation of Test Cases (TC) for Regression testing. In the lack of code artifacts from where to derive Test Plans, this work uses information conveyed by textual documents maintained by Industry, such as Change Requests. The proposed process is based on Information Retrieval techniques combined with indirect code coverage measures to select and prioritise TCs. The aim is to provide a high coverage Test Plan which would maximise the number of bugs found. This process was implemented as a prototype tool which was used in a case study with our industrial partner (Motorola Mobility). Experiments results revealed that the combined strategy provides better results than the use of information retrieval and code coverage independently. Yet, it is worth mentioning that any of these automated options performed better than the previous manual process deployed by our industrial partner to create test plans.", "published_in": "Journal of Systems and Software\nVolume 159, January 2020", "publisher": "Elsevier", "doi": "10.1016/j.jss.2019.110430", "date": "2019-09-24", "tcp": "X", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Industrial case studies\n\n(88 to 302 test cases)\n\nIndustrial proprietary, small scale", "prog_language": "Natural language", "ind_partner": "TRUE\nMotorola Mobility LLC", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "FALSE", "approach": "Hybrid Selection and Prioritisation based on Information Retrieval and Code Coverage", "info_approach": "Coverage-based", "alg_approach": "Search-based", "metrics": " - Code coverage\n - Correlation\n - CR (change request) coverage", "effe_metrics": "Coverage Effectiveness (CE)", "effi_metrics": "", "other_metrics": "", "open_challenges": " - investigating other prioritisation strategies\n - propose strategies / approaches to create and suggest new test cases or scenarios, in order to increase the coverage"}