{"type": "primary", "year": "2021", "authors": "Magalhães, Claudio; Mota, Alexandre; Momente, Luis", "author_keys": ["magalhaes_claudio", "mota_alexandre", "momente_luis"], "title": "UI Test case prioritization on an industrial setting: A search for the best criteria", "bibtex": "magalhaes_ui_2021", "abstract": "This work was developed in an industrial setting towards UI regression testing, where we do not have access to source code and the majority of test cases are manually executed (and only part of the regression-based test cases can be executed due to limited resources). Test case prioritization (TCP) is indicated for such a scenario. But characteristic of many TCP techniques is that they rely on source code coverage information, whereas we just have access to test cases, change requests, and their features. Thus, our goal is to investigate which criteria is the most relevant for prioritization. Thus, according to the literature we create an optimization model based on historical data. This model is embedded in a constraint solver designed for optimization. Our optimization function is based on the APFD (Average of the Percentage of Faults Detected) metric, but other metrics can be used as well. We have found that our partner already uses an appropriate criterion to identify failures which is statistically equivalent to other criteria used in experiments using our optimization model.", "published_in": "Software Quality Journal volume 29, pages 381–403 (2021)", "publisher": "Springer", "doi": "10.1007/s11219-021-09549-y", "date": "2021-04-15", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Industrial proprietary, small to medium scale\n\nMotorola \"test plans\" (30-826 TCs)", "prog_language": "Unclear", "ind_partner": "Motorola (Brazil/USA)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "MAYBE\n\nOnly results", "put_practice": "FALSE", "suppl_url": "https://github.com/cjasm/Data-for-Test-Case-Prioritization-on-an-industrial-setting", "approach": "An optimization model based on historical data", "info_approach": "", "alg_approach": "", "metrics": "APFD", "effe_metrics": "", "effi_metrics": "", "other_metrics": "", "open_challenges": "Improve execution time; integrate with HSP model; compare to AI techniques"}