{"type": "primary", "year": "2016", "authors": "Magalhães, Cláudio; Mota, Alexandre; Barros, Flávia; Maia, Eliot", "author_keys": ["magalhaes_claudio", "mota_alexandre", "barros_flavia", "maia_eliot"], "title": "Automatic selection of test cases for regression testing", "bibtex": "magalhaes_automatic_2016", "abstract": "Regression testing is a safety measure to attest that changes made on a system preserve prior accepted behavior. Identifying which test cases must compose a regression test suite in a certain development stage is tricky, particularly when one only has test cases and change requests described in natural language, and the execution of the test suite will be performed manually. That is the case of our industrial partner. We propose a selection of regression test cases based on information retrieval and implement as a web-service. In performed experiments, we show that we can improve the creation of regression test suites of our industrial partner by providing more effective test cases based on keywords analysis in an automatic way.", "published_in": "SAST: Proceedings of the 1st Brazilian Symposium on Systematic and Automated Software Testing", "publisher": "ACM", "doi": "10.1145/2993288.2993299", "date": "2016-09-19", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Test repository from Motorola (up to 427 TCs)", "ind_partner": "Motorola Mobility (Brazil)", "ind_author": "TRUE", "prac_feedback": "TRUE", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "", "approach": "An information retrieval-based TCS approach.", "metrics": "Traditional information retrieval-based metrics such as recall, number (and %) of elements returned at the top of the list (top-n).", "open_challenges": " - to completely replace the manual TCS approach with the automated one\n - try other variants of the merge strategy\n - Include source code as an input artefact\n - evaluate the effect of the derived TS on coverage"}