{"type": "primary", "year": "2016", "authors": "Marijan, Dusica; Liaaen, Marius", "author_keys": ["marijan_dusica", "liaaen_marius"], "title": "Effect of time window on the performance of continuous regression testing", "bibtex": "marijan_effect_2016", "abstract": "Test prioritization is an effective technique used to reduce the amount of work required to support regression testing in continuous integration development. It aims at finding an optimal order of tests that can detect regressions faster, potentially increasing the frequency of software releases. Prioritization techniques based on test execution history use the results of preceding executions to determine an optimal order of regression tests in the succeeding test executions. In this paper, we investigate how can execution history be optimally used to increase the effectiveness of regression test prioritization. We analyze the effect of history time window on the fault detection effectiveness of prioritized regression tests. We report an experimental study using a data set from Cisco. The results suggest that varying the size of the window can considerably change the performance of regression testing. Our findings will potentially help developers and test teams in adjusting test prioritization techniques for achieving higher cost-effectiveness in continuous regression testing.", "published_in": "2016 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "publisher": "IEEE", "doi": "10.1109/ICSME.2016.77", "date": "2017-01-16", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Cisco videoconferencing system (460 TCs)", "ind_partner": "Cisco (Norway)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "History-based, fault detection-based", "metrics": "fault detection capability, APFD", "open_challenges": "Utilize comprehensive cost-benefit measures, experiments in other industry domains"}