{"type": "primary", "year": "2019", "authors": "Najafi, Armin; Shang, Weiyi; Rigby, Peter C.", "author_keys": ["najafi_armin", "shang_weiyi", "rigby_peter_c"], "title": "Improving Test Effectiveness Using Test Executions History: An Industrial Experience Report", "bibtex": "najafi_improving_2019", "abstract": "The cost of software testing has become a burden for software companies in the era of rapid release and continuous integration. Our industrial collaborator Ericsson also faces the challenges of expensive testing processes which are typically part of a complex and specialized testing environment. In order to assist Ericsson with improving the test effectiveness of one of its large subsystems, we adopt test selection and prioritization approaches based on test execution history from prior research. By adopting and simulating those approaches on six months of testing data from our subject system, we confirm the existence of valuable information in the test execution history. In particular, the association between test failures provide the most value to the test selection and prioritization processes. More importantly, during this exercise, we encountered various challenges that are unseen or undiscussed in prior research. We document the challenges, our solutions and the lessons learned as an experience report. Our experiences can be valuable for other software testing practitioners and researchers who would like to adopt existing test effectiveness improvement approaches into their work environment.", "published_in": "2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "publisher": "IEEE", "doi": "10.1109/ICSE-SEIP.2019.00031", "date": "2019-08-19", "tcp": "X", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Undisclosed large-scale system at Ericsson\n\nIndustrial proprietary, supposedly large-scale", "prog_language": "Unclear (\"modern typical programming language\")", "ind_partner": "Ericsson (Canada)", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "history-based", "info_approach": "History-based", "alg_approach": "", "metrics": "Failure frequency, failure association, cost, execution time, missed failures, execution cost", "effe_metrics": "Fault Detection Loss", "effi_metrics": "Execution time", "other_metrics": "", "open_challenges": "Evaluate best duration of training data; consider dependencies among tests."}