{"type": "primary", "year": "2022", "authors": "Omri, Safa; Sinz, Carsten", "author_keys": ["omri_safa", "sinz_carsten"], "title": "Learning to Rank for Test Case Prioritization", "bibtex": "omri_learning_2022", "abstract": "In Continuous Integration (CI) environments, the productivity of software engineers depends strongly on the ability to reduce the round-trip time between code commits and feedback on failed test cases. Test case prioritization is popularly used as an optimization mechanism for ranking tests by their likelihood in revealing failures. However, existing techniques are usually time and resource intensive making them not suitable to be applied within CI cycles. This paper formulates the test case prioritization problem as an online learn-to-rank model using reinforcement learning techniques. Our approach minimizes the testing overhead and continuously adapts to the changing environment as new code and new test cases are added in each CI cycle. We validated our approach on an industrial case study showing that over 95% of the test failures are still reported back to the software engineers while only 40% of the total available test cases are being executed.", "published_in": "2022 IEEE/ACM 15th International Workshop on Search-Based Software Testing (SBST)", "publisher": "IEEE/ACM", "doi": "10.1145/3526072.3527525", "date": "2022-07-04", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Academic dataset, small to very large scale\nIndustrial open-source, medium to large scale\n\nABB Paint Control\nABB IOF/ROL\nGoogle GSDTSR", "prog_language": "Language-agnostic", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "MAYBE\n\nSupposedly yes, apparently unavailable", "put_practice": "FALSE", "suppl_url": "https://github.com/so1188/learntec (private)\n\nhttps://github.com/so1188/data", "approach": "reinforcement learning", "metrics": "recall, APFD", "open_challenges": ""}