{"type": "primary", "year": "2016", "authors": "Öqvist, Jesper; Hedin, Görel; Magnusson, Boris", "author_keys": ["oqvist_jesper", "hedin_gorel", "magnusson_boris"], "title": "Extraction-based regression test selection", "bibtex": "oqvist_extraction-based_2016", "abstract": "Frequent regression testing is a core activity in agile software development, but large test suites can lead to long test running times, hampering agility. By safe RTS (Regression Test Selection) techniques, a subset of the tests can be identified that cover all tests that can change result since the last run. To pay off in practice, the RTS overhead must be low. Most existing RTS techniques are based on dynamic coverage analysis, making the overhead related to the tests run. We present Extraction-Based RTS, a new safe RTS technique which uses a fast static analysis with very low overhead, related to the size of the modification rather than to the tests run. The method is suitable for program-driven testing, commonly used in agile development, where each test is a piece of code that uses parts of the system under test. We have implemented the method for Java, and bench-marked it on a number of open source projects, showing that it pays off substantially in practice.", "published_in": "PPPJ '16: Proceedings of the 13th International Conference on Principles and Practices of Programming on the Java Platform: Virtual Machines, Languages, and Tools", "publisher": "ACM", "doi": "10.1145/2972206.2972224", "date": "2016-08-29", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "five Open Source Java projects (from 20-254K lines of code, up to 271 TCs): Apache Commons Lang, Closure\nCompiler, Functor, Jaxen, and JUnit.\n\nOpen-source, small scale.", "prog_language": "Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "TRUE\n\nReplication package, well-documented", "put_practice": "FALSE", "suppl_url": "https://bitbucket.org/joqvist/autorts\n\nhttps://bitbucket.org/joqvist/tsbench/src/master/", "approach": "\"safe regression test selection method for program-\ndriven testing\": a variation on change-based focusing on the size of the changes", "info_approach": "Change-based", "alg_approach": "", "metrics": "total running time", "effe_metrics": "", "effi_metrics": "Total/End-to-end time", "other_metrics": "", "open_challenges": " - develop methods for generating program-driven tests from input-\ndriven tests\n - combine the\nmethod with unsafe RTS methods to be able to skip tests"}