{"type": "primary", "year": "2019", "authors": "Philip, Adithya Abraham; Bhagwan, Ranjita; Kumar, Rahul; Maddila, Chandra Sekhar; Nagppan, Nachiappan", "author_keys": ["philip_adithya_abraham", "bhagwan_ranjita", "kumar_rahul", "maddila_chandra_sekhar", "nagppan_nachiappan"], "title": "FastLane: Test Minimization for Rapidly Deployed Large-Scale Online Services", "bibtex": "philip_fastlane:_2019", "abstract": "Today, we depend on numerous large-scale services for basic operations such as email. These services, built on the basis of Continuous Integration/Continuous Deployment (CI/CD) processes, are extremely dynamic: developers continuously commit code and introduce new features, functionality and fixes. Hundreds of commits may enter the code-base in a single day. Therefore one of the most time-critical, yet resource-intensive tasks towards ensuring code-quality is effectively testing such large code-bases. This paper presents FastLane, a system that performs data-driven test minimization. FastLane uses light-weight machine-learning models built upon a rich history of test and commit logs to predict test outcomes. Tests for which we predict outcomes need not be explicitly run, thereby saving us precious test-time and resources. Our evaluation on a large-scale email and collaboration platform service shows that our techniques can save 18.04%, i.e., almost a fifth of test-time while obtaining a test outcome accuracy of 99.99%.", "published_in": "2019 IEEE/ACM 41st International Conference on Software Engineering (ICSE)", "publisher": "IEEE", "doi": "10.1109/ICSE.2019.00054", "date": "2019-08-26", "tcp": "", "tcs": "", "tsr": "X", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Microsoft Office 365 (tens of thousands of TCs)", "ind_partner": "Microsoft (India)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "MAYBE", "suppl_url": "", "approach": "machine learning-based", "metrics": "Precision/Recall, time saved", "open_challenges": ""}