{"type": "primary", "year": "2016", "authors": "Pradhan, Dipesh; Wang, Shuai; Ali, Shaukat; Yue, Tao", "author_keys": ["pradhan_dipesh", "wang_shuai", "ali_shaukat", "yue_tao"], "title": "Search-Based Cost-Effective Test Case Selection within a Time Budget: An Empirical Study", "bibtex": "pradhan_search-based_2016", "abstract": "Due to limited time and resources available for execution, test case selection always remains crucial for cost-effective testing. It is even more prominent when test cases require manual steps, e.g., operating physical equipment. Thus, test case selection must consider complicated trade-offs between cost (e.g., execution time) and effectiveness (e.g., fault detection capability). Based on our industrial collaboration within the Maritime domain, we identified a real-world and multi-objective test case selection problem in the context of robustness testing, where test case execution requires human involvement in certain steps, such as turning on the power supply to a device. The high-level goal is to select test cases for execution within a given time budget, where test engineers provide weights for a set of objectives, depending on testing requirements, standards, and regulations. To address the identified test case selection problem, we defined a fitness function including one cost measure, i.e., Time Difference (TD) and three effectiveness measures, i.e., Mean Priority (MPR), Mean Probability (MPO) and Mean Consequence (MC) that were identified together with test engineers. We further empirically evaluated eight multi-objective search algorithms, which include three weight-based search algorithms (e.g., Alternating Variable Method) and five Pareto-based search algorithms (e.g., Strength Pareto Evolutionary Algorithm 2 (SPEA2)) using two weight assignment strategies (WASs). Notice that Random Search (RS) was used as a comparison baseline. We conducted two sets of empirical evaluations: 1) Using a real world case study that was developed based on our industrial collaboration; 2) simulating the real world case study to a larger scale to assess the scalability of the search algorithms. Results show that SPEA2 with either of the WASs performed the best for both the studies. Overall, SPEA2 managed to improve on average 32.7%, 39% and 33% in terms of MPR, MPO and MC respectively as compared to RS.", "published_in": "GECCO '16: Proceedings of the Genetic and Evolutionary Computation Conference 2016", "publisher": "ACM", "doi": "10.1145/2908812.2908850", "date": "2016-07-20", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Realistic case study based on standards, public requirements and a handbook (165 TCs)\n\nIndustrial proprietary, small scale", "prog_language": "N/A", "ind_partner": "Undisclosed oil & gas company (Norway)", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Search-based", "info_approach": "", "alg_approach": "Search-based", "metrics": "fitness value, hypervolume", "effe_metrics": "Fault detection within a budget, Algorithm performance measures", "effi_metrics": "", "other_metrics": "", "open_challenges": "Hybrid search and evolutionary algorithms for better performance."}