{"type": "primary", "year": "2017", "authors": "Ramler, Rudolf; Salomon, Christian; Buchgeher, Georg; Lusser, Michael", "author_keys": ["ramler_rudolf", "salomon_christian", "buchgeher_georg", "lusser_michael"], "title": "Tool support for change-based regression testing: An industry experience report", "bibtex": "ramler_tool_2017", "abstract": "Changes may cause unexpected side effects and inconsistencies. Regression testing is the process of re-testing a software system after changes have been made to ensure that the new version of the system has retained the capabilities of the old version and that no new defects have been introduced. Regression testing is an essential activity, but it is also time-consuming and costly. Thus, regression testing should concentrate on those parts of the system that have been modified or which are affected by changes. Regression test selection has been proposed over three decades ago and, since then, it has been frequently in the focus of empirical studies. However, regression test selection is still not widely adopted in practice. Together with the test team of an industrial software company we have developed a tool-based approach that assists software testers in selecting regression test cases based on change information and test coverage data. This paper describes the main usage scenario of the approach, illustrates the implemented solution, and reports on its evaluation in a large industry project. The evaluation showed that the tool support reduces the time required for compiling regression test suites and fosters an accurate selection of regression test cases. The paper concludes with our lessons learned from implementing the tool support in a real-world setting. © Springer International Publishing AG 2017.", "published_in": "SWQD 2017: Software Quality. Complexity and Challenges of Software Engineering in Emerging Technologies", "publisher": "Springer", "doi": "10.1007/978-3-319-49421-0_10", "date": "2016-11-12", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Undisclosed software system at Omicron (over 5000 TCs)", "ind_partner": "OMICRON Electronics GmbH (Austria)", "ind_author": "TRUE", "prac_feedback": "TRUE", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "", "approach": "change-based, coverage-based, graph walk", "metrics": "testing time", "open_challenges": "lack of details provided by version control; redundant test cases; polluted coverage footprints; creating and maintaining coverage"}