{"type": "primary", "year": "2016", "authors": "Schwartz, Amanda; Do, Hyunsook", "author_keys": ["schwartz_amanda", "do_hyunsook"], "title": "Cost-effective regression testing through adaptive test prioritization strategies", "bibtex": "schwartz_cost-effective_2016", "abstract": "We propose two new ATP (Adaptive Test Prioritization) strategies.We \nconduct an empirical study investigating existing and new ATP \nstrategies.We provide a statistical analysis examining all ATP \nstrategies proposed.Our findings show that FESART is the most consistent\n cost-effective ATP strategy. Regression testing is an important part of\n the software development life cycle. It is also very expensive. Many \ndifferent techniques have been proposed for reducing the cost of \nregression testing. However, research has shown that the effectiveness \nof different techniques varies under different testing environments and \nsoftware change characteristics. In prior work, we developed strategies \nto investigate ways of choosing the most cost-effective regression \ntesting technique for a particular regression testing session. In this \nwork, we empirically study the existing strategies presented in prior \nwork as well as develop two additional Adaptive Test Prioritization \n(ATP) strategies using fuzzy analytical hierarchy process (AHP) and the \nweighted sum model (WSM). We also provide a comparative study examining \neach of the ATP strategies presented to date. This research will provide\n researchers and practitioners with strategies to utilize in regression \ntesting plans as well as provide data to use when deciding which of the \nstrategies would best fit their testing needs. The empirical studies \nprovided in this research show that utilizing these strategies can \nimprove the cost-effectiveness of regression testing.", "published_in": "Journal of Systems and Software", "publisher": "Elsevier", "doi": "10.1016/j.jss.2016.01.018", "date": "2016-01-27", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "SIR (up to 912 TCs)\n\nResearch dataset, medium scale", "prog_language": "Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Approach is adaptively chosen for each software and even version using some decision support system", "metrics": "Eelative cost-benefit (in dollars) among compared TCP techniques", "open_challenges": "Expand to other techniques, and to larger programs."}