{"type": "primary", "year": "2018", "authors": "Shi, August; Gyori, Alex; Mahmood, Suleman; Zhao, Peiyuan; Marinov, Darko", "author_keys": ["shi_august", "gyori_alex", "mahmood_suleman", "zhao_peiyuan", "marinov_darko"], "title": "Evaluating test-suite reduction in real software evolution", "bibtex": "shi_evaluating_2018", "abstract": "Test-suite reduction (TSR) speeds up regression testing by removing redundant tests from the test suite, thus running fewer tests in the future builds. To decide whether to use TSR or not, a developer needs some way to predict how well the reduced test suite will detect real faults in the future compared to the original test suite. Prior research evaluated the cost of TSR using only program versions with seeded faults, but such evaluations do not explicitly predict the effectiveness of the reduced test suite in future builds.\n\nWe perform the first extensive study of TSR using real test failures in (failed) builds that occurred for real code changes. We analyze 1478 failed builds from 32 GitHub projects that run their tests on Travis. Each failed build can have multiple faults, so we propose a family of mappings from test failures to faults. We use these mappings to compute Failed-Build Detection Loss (FBDL), the percentage of failed builds where the reduced test suite misses to detect all the faults detected by the original test suite. We find that FBDL can be up to 52.2%, which is higher than suggested by traditional TSR metrics. Moreover, traditional TSR metrics are not good predictors of FBDL, making it difficult for developers to decide whether to use reduced test suites.", "published_in": "ISSTA 2018: Proceedings of the 27th ACM SIGSOFT International Symposium on Software Testing and Analysis", "publisher": "ACM", "doi": "10.1145/3213846.3213875", "date": "2018-07-12", "tcp": "", "tcs": "", "tsr": "X", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source programs (up to 770 TCs)\n\nOpen-source, medium scale", "prog_language": "Unclear", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "coverage-based", "info_approach": "Coverage-based", "alg_approach": "", "metrics": "FBDL (failed build detection loss)", "effe_metrics": "Fault Detection Loss", "effi_metrics": "", "other_metrics": "", "open_challenges": "n/a"}