{"type": "primary", "year": "2016", "authors": "Strandberg, Per Erik; Sundmark, Daniel; Afzal, Wasif; Ostrand, Thomas J.; Weyuker, Elaine J.", "author_keys": ["strandberg_per_erik", "sundmark_daniel", "afzal_wasif", "ostrand_thomas_j", "weyuker_elaine_j"], "title": "Experience Report: Automated System Level Regression Test Prioritization Using Multiple Factors", "bibtex": "strandberg_experience_2016", "abstract": "We propose a new method of determining an effective ordering of regression test cases, and describe its implementation as an automated tool called SuiteBuilder developed by Westermo Research and Development AB. The tool generates an efficient order to run the cases in an existing test suite by using expected or observed test duration and combining priorities of multiple factors associated with test cases, including previous fault detection success, interval since last executed, and modifications to the code tested. The method and tool were developed to address problems in the traditional process of regression testing, such as lack of time to run a complete regression suite, failure to detect bugs in time, and tests that are repeatedly omitted. The tool has been integrated into the existing nightly test framework for Westermo software that runs on large-scale data communication systems. In experimental evaluation of the tool, we found significant improvement in regression testing results. The re-ordered test suites finish within the available time, the majority of fault-detecting test cases are located in the first third of the suite, no important test case is omitted, and the necessity for manual work on the suites is greatly reduced. © 2016 IEEE.", "published_in": "2016 IEEE 27th International Symposium on Software Reliability Engineering (ISSRE)", "publisher": "IEEE", "doi": "10.1109/ISSRE.2016.23", "date": "2016-12-08", "tcp": "X", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Embedded systems running Westermo's operating system WeOS  (unknown scale)\n\nIndustrial proprietary, unknown scale", "prog_language": "Python", "ind_partner": "Westermo Research and Development (Sweden)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "", "approach": "History-based, change-based", "metrics": "Testing time; fault detection rate", "open_challenges": "Different kinds of suites and prioritizers; apply approach to minimization"}