{"type": "primary", "year": "2016", "authors": "Wang, Shuai; Ali, Shaukat; Yue, Tao; Bakkeli, Oyvind; Liaaen, Marius", "author_keys": ["wang_shuai", "ali_shaukat", "yue_tao", "bakkeli_oyvind", "liaaen_marius"], "title": "Enhancing test case prioritization in an industrial setting with resource awareness and multi-objective search", "bibtex": "wang_enhancing_2016", "abstract": "Test case prioritization is an essential part of test execution systems for large organizations developing software systems in the context that their software versions are released very frequently. They must be tested on a variety of compatible hardware with different configurations to ensure correct functioning of a software version on a compatible hardware. In practice, test case execution must not only execute cost-effective test cases in an optimal order, but also optimally allocate required test resources, in order to deliver high quality software releases. To optimize the current test execution system for testing software releases developed for Videoconferencing Systems (VCSs) at Cisco, Norway, in this paper, we propose a resource-aware multi-objective optimization solution with a fitness function defined based on four cost-effectiveness measures. In this context, a set of software releases must be tested on a set of compatible VCS hardware (test resources) by executing a set of cost-effective test cases in an optimal order within a given test cycle constrained by maximum allowed time budget and maximum available test resources. We empirically evaluated seven search algorithms regarding their performance and scalability by comparing with the current practice (random ordering (RO)). The results show that the proposed solution with the best search algorithm (i.e., Random-Weighted Genetic Algorithm) improved the current practice by reducing on average 40.6% of time for test resource allocation and test case execution, improved test resource usage on average by 37.9% and fault detection on average by 60%.", "published_in": "ICSE '16: Proceedings of the 38th International Conference on Software Engineering Companion", "publisher": "ACM", "doi": "10.1145/2889160.2889240", "date": "2016-05-14", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Cisco videoconferencing system (305 TCs)\n\nIndustrial proprietary, small scale", "prog_language": "Unclear", "ind_partner": "Cisco (Norway)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "FALSE", "put_practice": "MAYBE", "suppl_url": "", "approach": "resource-aware, multi-objective search", "metrics": "Number of test cases, resource usage, fault detection capability, total time, prioritization density", "open_challenges": "Further industrial case studies; survey with Cisco engineers for validation and application of approach."}