{"type": "primary", "year": "2019", "authors": "Yackley, Jeffrey J.; Kessentini, Marouane; Bavota, Gabriele; Alizadeh, Vahid; Maxim, Bruce R.", "author_keys": ["yackley_jeffrey_j", "kessentini_marouane", "bavota_gabriele", "alizadeh_vahid", "maxim_bruce_r"], "title": "Simultaneous refactoring and regression testing", "bibtex": "yackley_simultaneous_2019", "abstract": "Currently, refactoring and regression testing are treated independently by existing studies. However, software developers frequently switch between these two activities, using regression testing to identify unwanted behavior changes introduced while refactoring and applying refactoring on identified buggy code fragments. Our hypothesis is that the tools to support developers in these two tasks could transfer part of the knowledge extracted from the process of finding refactoring opportunities to identify relevant test cases, and vice-versa. We propose a simultasking, search-based algorithm that unifies the tasks of refactoring and regression testing, hence solving them simultaneously and enabling knowledge transfer between them. The salient feature of the proposed algorithm is a unified and generic solution representation scheme for both problems, which serves as a common platform for knowledge transfer between them. We implemented and evaluated the proposed simultasking approach on six opensource systems and one industrial project. Our study features quantitative and qualitative analysis performed with developers, and the results achieved show that the proposed approach provides advantages over mono-task techniques treating refactoring and regression testing separately. © 2019 IEEE.", "published_in": "2019 19th International Working Conference on Source Code Analysis and Manipulation (SCAM)", "publisher": "IEEE", "doi": "10.1109/SCAM.2019.00032", "date": "2019-12-12", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "FALSE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source Java projects (up to 128 TCs)", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "TRUE", "avai_tool": "FALSE", "put_practice": "FALSE", "suppl_url": "", "approach": "Search-based", "metrics": "quality metric based on reusability, flexibility, understandability and effectiveness (but this is a metric for the refactoring)", "open_challenges": ""}