{"type": "primary", "year": "2022", "authors": "Yaraghi, Ahmadreza Saboor; Bagherzadeh, Mojtaba; Kahani, Nafiseh; Briand, Lionel", "author_keys": ["yaraghi_ahmadreza_saboor", "bagherzadeh_mojtaba", "kahani_nafiseh", "briand_lionel"], "title": "Scalable and Accurate Test Case Prioritization in Continuous Integration Contexts", "bibtex": "yaraghi_scalable_2022", "abstract": "Continuous Integration (CI) requires efficient regression testing to ensure software quality without significantly delaying its CI builds. This warrants the need for techniques to reduce regression testing time, such as Test Case Prioritization (TCP) techniques that prioritize the execution of test cases to detect faults as early as possible. Many recent TCP studies employ various Machine Learning (ML) techniques to deal with the dynamic and complex nature of CI. However, most of them use a limited number of features for training ML models and evaluate the models on subjects for which the application of TCP makes little practical sense, due to their small regression testing time and low number of failed builds. In this work, we first define, at a conceptual level, a data model that captures data sources and their relations in a typical CI environment. Second, based on this data model, we define a comprehensive set of features that covers all features previously used by related studies. Third, we develop methods and tools to collect the defined features for 25 open-source software systems with enough failed builds and whose regression testing takes at least five minutes. Fourth, relying on the collected dataset containing a comprehensive feature set, we answer four research questions concerning data collection time, the effectiveness of ML-based TCP, the impact of the features on effectiveness, the decay of ML-based TCP models over time, and the trade-off between data collection time and the effectiveness of ML-based TCP techniques. IEEE", "published_in": "IEEE Transactions on Software Engineering", "publisher": "IEEE", "doi": "10.1109/TSE.2022.3184842", "date": "2022-06-20", "tcp": "X", "tcs": "", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source, small to large scale\n\n25 open-source Java projects (up to 1M LOC, 4364 TCs)", "prog_language": "Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "TRUE\n\nReplication package, well-documented", "put_practice": "FALSE", "suppl_url": "https://github.com/Ahmadreza-SY/TCP-CI", "approach": "machine learning based", "info_approach": "", "alg_approach": "Machine learning-based", "metrics": "APFDc, scalability", "effe_metrics": "Average Percentage of Faults Detected (APFD)", "effi_metrics": "Scalability", "other_metrics": "", "open_challenges": "Potential correlation between APFDc and subject characteristics; trade-offs between granularity of coverage; scalability; TCP effectiveness"}