{"type": "primary", "year": "2016", "authors": "Yoshida, Hiroaki; Tokumoto, Susumu; Prasad, Mukul R.; Ghosh, Idradeep; Uehara, Tadahiro", "author_keys": ["yoshida_hiroaki", "tokumoto_susumu", "prasad_mukul_r", "ghosh_idradeep", "uehara_tadahiro"], "title": "FSX: A tool for fine-grained incremental unit test generation for C/C++ Programs", "bibtex": "yoshida_fsx_2016", "abstract": "Automated unit test generation bears the promise of significantly reducing test cost and hence improving software quality. However, the maintenance cost of the automatically generated tests presents a significant barrier to adoption of this technology. To address this challenge, in previous work, we proposed a novel technique for automated and fine-grained incremental generation of unit tests through minimal augmentation of an existing test suite. In this paper we describe a tool FSX, implementing this technique. We describe the architecture, user-interface, and salient features of FSX, and specific practical use-cases of its technology. We also report on a real, large-scale deployment of FSX as a practical validation of the underlying research contribution and of automated test generation research in general. © 2016 ACM.", "published_in": "FSE 2016: Proceedings of the 2016 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering", "publisher": "ACM", "doi": "10.1145/2950290.2983937", "date": "2016-11-01", "tcp": "", "tcs": "", "tsr": "", "tsa": "X", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source tool iPerf (114 TCs)\n\nOpen-source, small scale", "prog_language": "C", "ind_partner": "Fujitsu (Japan)", "ind_author": "TRUE", "prac_feedback": "TRUE", "avai_tool": "FALSE", "put_practice": "TRUE", "suppl_url": "", "approach": "Coverage-based", "info_approach": "Coverage-based", "alg_approach": "", "metrics": "Statement coverage, branch coverage, #tests, runtime", "effe_metrics": "Coverage Effectiveness (CE), Number of tests added", "effi_metrics": "Execution time", "other_metrics": "", "open_challenges": "n/a"}