{"type": "primary", "year": "2021", "authors": "Rosenbauer, Lukas; Stein, Anthony; Hähner, Jörg", "author_keys": ["rosenbauer_lukas", "stein_anthony", "hahner_jorg"], "title": "An Artificial Immune System for Black Box Test Case Selection", "bibtex": "zarges_artificial_2021", "abstract": "Testing is a crucial part of the development of a new product. For software validation a transformation from manual to automated tests can be observed which enables companies to implement large numbers of test cases. However, during testing situations may occur where it is not feasible to run all tests due to time constraints. Hence a set of critical test cases must be compiled which usually fulfills several criteria. Within this work we focus on criteria that are feasible for black box testing such as system tests. We adapt an existing artificial immune system for our use case and evaluate our method in a series of experiments using industrial datasets. We compare our approach with several other test selection methods where our algorithm shows superior performance.", "published_in": "Evolutionary Computation in Combinatorial Optimization: 21st European Conference, EvoCOP 2021, Held as Part of EvoStar 2021, Virtual Event, April 7--9, 2021, Proceedings", "publisher": "Springer", "doi": "10.1007/978-3-030-72904-2_11", "date": "2021-03-27", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "TRUE", "exp_subjects": "Industrial proprietary, small to medium scale.\n\nThree datasets from the industrial partner (up to 1499 TCs)", "prog_language": "Unclear", "ind_partner": "BSH Hausgeräte GmbH (Germany)", "ind_author": "TRUE", "prac_feedback": "FALSE", "avai_tool": "TRUE\n\nReplication package, poorly documented", "put_practice": "FALSE", "suppl_url": "https://github.com/LagLukas/moa_testing", "approach": "nature-inspired GCAIS is applied for selection, and optimization is multiobjective, including maximinzing req coverage, max probab of failure and minim time (they assume a time budget)", "metrics": "a) time budget needed to reveal the first error\nb) Number of broken features found (would be the req causing the failure)\n", "open_challenges": "Not much developed, they mention applying GCAIS to white box testing (which is a bit contradictory)"}