{"type": "primary", "year": "2018", "authors": "Zhang, Lingming", "author_keys": ["zhang_lingming"], "title": "Hybrid regression test selection", "bibtex": "zhang_hybrid_2018", "abstract": "Regression testing is crucial but can be extremely costly. Regression Test Selection (RTS) aims to reduce regression testing cost by only selecting and running the tests that may be affected by code changes. To date, various RTS techniques analyzing at different granularities (e.g., at the basic-block, method, and file levels) have been proposed. RTS techniques working on finer granularities may be more precise in selecting tests, while techniques working on coarser granularities may have lower overhead. According to a recent study, RTS at the file level (FRTS) can have less overall testing time compared with a finer grained technique at the method level, and represents state-of-the-art RTS. In this paper, we present the first hybrid RTS approach, HyRTS, that analyzes at multiple granularities to combine the strengths of traditional RTS techniques at different granularities. We implemented the basic HyRTS technique by combining the method and file granularity RTS. The experimental results on 2707 revisions of 32 projects, totalling over 124 Million LoC, demonstrate that HyRTS outperforms state-of-the-art FRTS significantly in terms of selected test ratio and the offline testing time. We also studied the impacts of each type of method-level changes, and further designed two new HyRTS variants based on the study results. Our additional experiments show that transforming instance method additions/deletions into file-level changes produces an even more effective HyRTS variant that can significantly outperform FRTS in both offline and online testing time.", "published_in": "ICSE '18: Proceedings of the 40th International Conference on Software Engineering", "publisher": "ACM", "doi": "10.1145/3180155.3180198", "date": "2018-09-03", "tcp": "", "tcs": "X", "tsr": "", "tsa": "", "ind_motivation": "TRUE", "ind_evaluation": "FALSE", "exp_subjects": "Open-source Java projects (up to 16069 TCs)\n\nOpen-source, very large scale", "prog_language": "Java", "ind_partner": "", "ind_author": "FALSE", "prac_feedback": "FALSE", "avai_tool": "TRUE\n\nUsable tool, Maven plug-in", "put_practice": "FALSE", "suppl_url": "http://hyrts.org/", "approach": "A dynamic approach to TCS that combines file-level (like Ekstazi) with method level selection, under different variations, to improve precision while keeping efficiency", "info_approach": "Change-based", "alg_approach": "", "metrics": "- Selected test ratio\n\n- E2E testing time ", "effe_metrics": "Selection/reduction count/percentage", "effi_metrics": "Total/End-to-end time", "other_metrics": "", "open_challenges": "Apply the idea of hybris also to static RTS techniques"}